Revit 2027 API
ParameterDownloadOptions Constructor
Overload List
Name | Description
ParameterDownloadOptions() |  Default constructor.
ParameterDownloadOptions(ISet<ElementId>, Boolean, Boolean, ForgeTypeId) |  Creates a new ParameterDownloadOptions instance. Category bindings are represented by an ElementIdSet populated with category identifiers.
Top
See Also
Reference
ParameterDownloadOptions Class
Autodesk.Revit.DB Namespace